[
    {
        "speech": "speech at prayer meeting, Sabarmati Ashram",
        "text": "In all probability this will be my last speech to you. Even if the Government allow me to march tomorrow morning, this will be my last speech on the sacred banks of the Sabarmati. Possibly these may be the last words of my life here. I have already told you yesterday what I had to say. Today I shall confine myself to what you should do after I and my companions are arrested. The programme of the march to Jalalpur must be fulfilled as originally settled. The enlistment of volunteers for this purpose should be confined to Gujarat. From what I have seen and heard during the last fortnight I am inclined to believe that the stream of civil resisters will flow unbroken. But let there be not a semblance of breach of peace even after all of us have been arrested. We have resolved to utilize all our resources in the pursuit of an exclusively non-violent struggle. Let no one commit a wrong in anger. This is my hope and prayer. I wish these words of mine reached every nook and corner of the land. My task shall be done if I perish and so do my comrades. It will then be for the Working Committee of the Congress to show you the way and it will be up to you to follow its lead. That is the only meaning of the Working Committee’s resolution. The reins of the movement will still remain in the hands of those of my associates who believe in non-violence as an article of faith. Of course, the Congress will be free to chalk out what course of action commends itself to it. So long as I have not reached Jalalpur, let nothing be done in contravention to the authority vested in me by the Congress. But once I am arrested, the whole general responsibility shifts to the Congress. No one who believes in non-violence, as a creed, need therefore sit still. My compact with the Congress ends as soon as I am arrested. In that case there should be no slackness in the enrolment of volunteers. Wherever possible, civil disobedience of salt laws should be started. These laws can be violated in three ways. It is an offence to manufacture salt wherever there are facilities for doing so. The possession and sale of contraband salt (which includes natural salt or salt earth) is also an offence. The purchasers of such salt will be equally guilty. To carry away the natural salt deposits on the seashore is likewise a violation of law. So is the hawking of such salt. In short, you may choose anyone or all of these devices to break the salt monopoly. We are, however, not to be content with this alone. Wherever there are Congress Committees, wherever there is no ban by the Congress and wherever the local workers have self-confidence, other suitable measures may be adopted. I prescribe only one condition, viz., let our pledge of truth and non-violence as the only means for the attainment of swaraj be faithfully kept. For the rest, everyone has a free hand. But that does not give a licence to all and sundry to carry on on their individual responsibility. Wherever there are local leaders, their orders should be obeyed by the people. Where there are no leaders and only a handful of men have faith in the programme, they may do what they can, if they have enough self-confidence. They have a right, nay, it is their duty, to do so. The history of the world is full of instances of men who rose to leadership by sheer force of self-confidence, bravery and tenacity. We too, if we sincerely aspire to swaraj and are impatient to attain it, should have similar self-confidence. Our ranks will swell and our hearts strengthen as the number of our arrests by Government increases. Let nobody assume that after I am arrested there will be no one left to guide them. It is not I but Pandit Jawaharlal who is your guide. He has the capacity to lead. Though the fact is that those who have learnt the lesson of fearlessness and self-effacement need no leader, but if we lack these virtues, not even Jawaharlal will be able to produce them in us. Much can be done in other ways besides these. Liquor and foreign-cloth shops can be picketed. We can refuse to pay taxes if we have the requisite strength. The lawyers can give up practice. The public can boycott the courts by refraining from litigation. Government servants can resign their posts. In the midst of the despair reigning all round people quake with fear of losing employment. Such men are unfit for swaraj. But why this despair? The number of Government servants in the country does not exceed a few hundred thousand. What about the rest? Where are they to go? Even free India will not be able to accommodate a greater number of public servants. A Collector then will not need the number of servants he has got today. He will be his own servant. How can a poor country like India afford to provide a Collector with separate servants for performing the duties of carrying his papers, sweeping, cooking, latrine-cleaning and letter-carrying? Our starving millions can by no means afford this enormous expenditure. If, therefore, we are sensible enough, let us bid good-bye to Government employment, no matter if it is the post of a judge or a peon. It may be difficult for a judge to leave his job, but where is the difficulty in the case of a peon? He can earn his bread everywhere by honest manual labour. This is the easiest solution of the problem of freedom. Let all who are co-operating with the Government in one way or another, be it by paying taxes, keeping titles, or sending children to official schools, etc., withdraw their co-operation in all or as many ways as possible. One can devise other methods, too, of non-co-operating with the Government. And then there are women who can stand shoulder to shoulder with men in this struggle. You may take it as my will. It was the only message that I desired to impart to you before starting on the march or for the jail. I wish there to be no suspension or abandonment of the war that commences tomorrow morning, or earlier if I am arrested before that time. I shall eagerly await the news that ten batches are ready as soon as my batch is arrested. I believe there are men in India to complete the work begun by me today. I have faith in the righteousness of our cause and the purity of our weapons. And where the means are clean, there God is undoubtedly present with His blessings. And where these three combine, there defeat is an impossibility. A satyagrahi, whether free or incarcerated, is ever victorious. He is vanquished only when he forsakes truth and non-violence and turns a deaf ear to the Inner Voice. If, therefore, there is such a thing as defeat for even a satyagrahi, he alone is the cause of it. God bless you all and keep off all obstacles from the path in the struggle that begins tomorrow. Let this be our prayer. [From Gujarati]",
        "date": "March 11, 1930",
        "source": "Young India, 20-3-1930"
    },
    {
        "speech": "speech at prayer meeting, Sabarmati Ashram",
        "text": "God willing, we shall set out exactly at 6.30. Those joining the march should all be on the spot at 6.20. If our first step is pure, all our subsequent steps will be good and pure. As Manilal is joining us, I would say something for his benefit. He should not join just because he is my son though he cannot help being my son, nor can I forget that I am his father. We who are setting out with a great responsibility on our heads—we the Ashram inmates—have but one capital. We can boast of no learning. We who took certain vows and pledged ourselves to the Ashram way of life ought to adhere to those vows scrupulously. The seventy-two2 men joining the march should once again read the Ashram rules and think whether or not they should join the march. Those inmates of the Ashram who have any dependants will not be able to draw money from the Ashram for them. None should join thestruggle with that hope. This fight is no public show; it is the final struggle—a life-and-death struggle. If there are disturbances, we may even have to die at the hands of our own people. Even in that case, we shall have made our full contribution to the satyagraha struggle. We have constituted ourselves the custodians of Hindu-Muslim unity. We hope to become the representatives of the poorest of the poor, the lowest of the low and the weakest of the weak. If we do not have the strength for this, we should not join the struggle. For my part I have taken no pledge not to return here, but I do ask you to return here only as dead men or as winners of swaraj. Chhaganlal Joshi will not be able to run up here if Dhiru falls ill. Even if the Ashram is on fire, we will not return. Only those may join, who have no special duty to their relatives. The marchers have vowed to follow life-long poverty and to observe brahmacharya for life. They leave here with the determination to observe brahmacharya and will remain faithful to that determination. The man who always follows truth and always proclaims what he does is a brave man. Anyone who deceives others is not brave. I cannot speak to anyone privately for I have not a minute to spare. Though addressing myself to Manilal particularly, I say this to all. We are entering upon a life-and-death struggle, a holy war we are performing an all-embracing sacrifice in which we wish to offer ourselves as oblation. If you prove incapable, the shame will be mine, not yours. You too have in you the strength that God has given me. The Self in us all is one and the same. In me it has awakened; in others, it has awakened partially. [From Gujarati]",
        "date": "March 12, 1930",
        "source": "From the manuscript of Mahadev Desai’s Diary"
    },
    {
        "speech": "speech at Aslali",
        "text": "Do not be content with merely wearing khadi and plying the spinning-wheel, thinking that you have done all that you could do. Take the case of your own village: For a population of 1,700, 850 maunds of salt will be required. For 200 bullocks, 300 maunds of salt will be required. That is, a total of 1,150 maunds of salt will be required. The Government levies a tax of Rs. 1-4 on one pukka maund of salt. Hence, on 1,150 maunds, which is equal to 575 pukka maunds, you pay a tax of Rs. 720. A bullock must be given two maunds of salt. In addition, there are 800 cows, buffaloes and calves in your village. If you give them salt, or if the tanner uses salt for treating hides, or if you use salt as manure, you would be paying that amount of tax in excess of Rs. 720. Can your village afford to pay this amount in taxes every year ? In India, the average income of an individual is calculated at 7 pice or, in other words, hundreds of thousands of persons do not earn even a single pice and either die of starvation or live by begging. Even they cannot do without salt. What will be the plight of such persons if they can get no salt or get it at too high a price? Salt, which sells at 9 pice a maund in the Punjab, salt of which heaps and heaps are being made on the coast of Kathiawar and Gujarat, cannot be had by the poor at less than Re. 1-8-0 a maund. What curses the Government may not be inviting upon itself from the poor for hiring men to throw this salt into mud! The poor destitute villagers do not have the strength to get this tax repealed. We want to develop this strength. A democratic State is one which has authority to abolish a tax which does not deserve to be paid. It is one in which the people can determine when a certain thing should or should not be paid. We, however, do not possess such authority. Likewise, even our supposedly great representatives do not have it. In the Central Legislative Assembly, Pandit Malaviya said that the manner inwhich Sardar Vallabhbhai was arrested could not be called just ; that it was unjust and high-handed. And this resolution was supported by Mr. Jinnah. To this the Government official replied that their magistrate had acted in a manner which befitted a loyal subject, if he had acted otherwise, he would have been regarded as a traitor. If, however, that is the case, this bearded person (Abbas Saheb) and I should also be arrested, because I on my part openly make speeches about preparing salt. We want to establish a government which will be unable to arrest a single individual against the wishes of the people, which cannot extract ghee worth even a quarter pice from us, cannot take away our carts, cannot extort money from us. There are two ways of establishing such a government: that of the big stick or violence and that of non-violence or civil disobedience. We have chosen the second alternative, regarding it as our dharma. And it is because of this that we have set out to prepare salt after serving notice on the Government to that effect. I can understand there being a tax on such things as the hookah, bidis and liquor. And if I were an emperor, I would levy with your permission a tax of one pie on every bidi. And if bidis are found too expensive, those addicted to them may give them up. But should one levy a tax on salt? Such taxes should now be repealed. We should make a resolve that we shall prepare salt, eat it, sell it to the people and, while doing so, court imprisonment, if necessary. If, out of Gujarat’s population of 90 lakhs, we leave out women and children, and the remaining 30 lakhs get ready to violate the salt tax, the Government does not have enough accommodation in jails to house so many people. Of course, the Government can also beat up and shoot down those who violate the law. But the governments of today are unable to go to this extent. We, however, are determined to let the Government kill us if it wishes. The salt tax must be repealed now. The fact that a sea of humanity had gathered and showered blessings upon us—for a distance of seven miles from the Ashram to the Chandola lake —a sight for the gods to see—that is a good omen. And, if we climb even one step, we shall readily be able to climb the other steps leading to the palace of Independence.",
        "date": "March 12, 1930",
        "source": "[From Gujarati] Navajivan, 16-3-1930"
    },
    {
        "speech": "speech at bareja",
        "text": "This is our second halt after the march began. As at our first halt, here too I was given the required information about this village. I was pained to read it. It is strange that a place so near Ahmedabad has zeroes against the columns for consumption of khadi, the number of habitual khadi rearers and spinning-wheels at work. During my tours of North and South India, I used to follow a rule, namely, that the barber cutting my hair should be a khadi-wearer. But here you keep yourselves far away from such a thing as khadi. Khadi is the foundation of our freedom struggle. All like khadi, but people are nowadays deterred by the fear that those wearing khadi will have to go to jail and die. Bareja has not a single khadi-wearer, which is indeed a very painful fact. There is a khadi store here and you can certainly remove this blot. We do not disown our mother because she is fat or ugly to look at and adopt another woman, more beautiful, to fill her place. Foreign cloth will never bring us freedom. I request you to renounce luxuries and buy khadi from this heap before you. At present Sardar is in jail, and I have come here to ask you to join in our common struggle for freedom. Think over the matter and get ready to join. The state of our villages is pitiable in various ways. With the help of these soldiers of freedom, you will be able to make your village clean. It does not take much time to do so. Diligence and care are all that is necessary. The people of this place number twenty-five hundred. If you so resolve, you can make the village beautiful and have as many amenities as you choose. By doing so, you will help agriculture here and also add to your strength. The education imparted in present-day schools is, according to me,no education at all. The village has a large number of Christians and Muslims also. If you all come together, you will be able to achieve much for the village. For winning complete freedom, all these communities will have to unite. As for the Bhangis, you believe that they are the scum of the earth. We do nothing at all for their betterment. We only lower ourselves by believing them to be of low birth. Now, having said this, let me turn to other things. We have come forward to win our freedom from this tyrannical and oppressive Government. If we cannot put our own house in order in an organized manner, how shall we run the country’s Government? I ask you, therefore, to learn order and organization. Think of cow-protection also. In this band marching with me, there are experts on animal husbandry who will be able to help you. Introducing improvements by slow degrees, you can solve the question of cow-protection. Do think about these things. This struggle against the Government on which we have embarked is not going to reach its conclusion with five, or twenty-five, or even millions of men getting killed. We have to look after these other things also simultaneously.",
        "date": "March 13, 1930",
        "source": "[From Gujarati] Prajabandhu, 16-3-1930"
    },
    {
        "speech": "speech at navagam",
        "text": "As I enter the Kheda District, memories—some sweet, some bitter—fill the mind. It was while working in the Kheda District that I became one with the lives of people. I have seen nearly all the villages here. I covered many of them on foot. I have come to Navagam in the middle of a battle. This is our third halt: Aslali was the first, Bareja was the second and Navagam now is the third. Vallabhbhai had great expectations of the Kheda District. Having been arrested in this district, he has won glory for himself. The Government found some pretext or other to arrest Vallabhbhai. It knew well that his, and not the Government’s, writ would prevail in Kheda if he was free. Pressure was brought to bear on the Magistrate somehow to serve a notice on Sardar, and he was arrested. What could a poor Magistrate do where the entire atmosphere is vitiated? We do not yet have the necessary spirit of self-sacrifice and the necessary self-confidence for anyone of us to tell the Government that he could not issue such a notice. What does it matter that a person receives salary from the Government? And, moreover, who pays that salary? Who am I to explain to the Magistrate that it is God who does that? How can I do it? To the Magistrate the Government is God, the protector, and everything. The Patidars and the Dharalas, the two principal communities of the Kheda District, are both courageous. What will they do to fight this Government? Before I ask the question, I have to congratulate you all. All the Matadars here have shown great courage in my presence and stated that they would not accept the Headman’s office, with the result that the latter has now resigned. I congratulate you on your resignations. If you have been offering resignations under pressure from anyone, I must ask you to withdraw them. Not only will that cause me no pain, but I will protect you against those who might try to force you to resign. This fight is based on truth. I want no victory with unworthy help. It is after many days and nights of heart-searching that I have decided to stake my life on this last struggle, and to take my coworkers with me so that they, too, may sacrifice their lives. I depend on truth alone for winning this war. I shall be happy if I have your support in that. It will make no difference to me even if you do not resign. When we win swaraj, even a scavenger will be free to take Vallabhbhai to task. When he was in jail Vallabhbhai used to ask whom he could fight when all officials from the peon upward were Indians. You should remember this. With the present Government might is right. But, against me, its guns and gunpowder are no more than dust or pebbles. Your present duty is to show the Government your strength through your work. Be true to your word, Headman and Matadars, if you are bent on winning complete independence. You should remember and act upon Tulsidas’s words: “The way of the Raghus it has been ever, Life may be lost but a pledge never.” Before all these present here I remind you of this. Listen to me and, if you so feel, admit truthfully that you do not have the strength to resign. The people of the Kheda District have bathed me in their love. No resident of this district should first give me a promise and then stab me in the back. I shall regard you as brave men if you truthfully withdraw your resignations, and also if you truthfully adhere to them.1 In the present struggle, which we have started to establish Ramarajya, both the poor and the rich are ready to give me monetary help, but I look up to the people for strengthening me. You will have redoubled my strength when, following me, you come forward to manufacture salt. By leading you along my path, I wish to bring glory to one and all among us. I may ask for your resignations or for money from you; but for the present I am asking for soldiers for this fight. Civil disobedience of the salt law is within the power of all— men and women, young and old. I have gone through the figures regarding Navagam. In the population numbering a thousand, only one person is a habitual khadi-wearer and there is just one spinning-wheel to swear by. I ask you now to take a vow to produce and wear khadi. That way you will save Rs. 5,000 a year. By working at the spinning-wheel, women too will be adding to their power greatly. Remember that in the resignations you have handed in I see God’s hand. The Kheda District has made an auspicious beginning. I have embarked on this last struggle of my life because God wishes to make me His instrument for this work. The life of this skeleton which is addressing you is God, and it does whatever good He desires. Let us now part with Ramanama on our lips.",
        "date": "March 13, 1930",
        "source": "[From Gujarati] Prajabandhu, 16-3-1930"
    },
    {
        "speech": "speech at vasana1",
        "text": "You have all given us an excellent reception. You have seen to it that there is nothing wanting. You have raised this pandal and erected a cottage for me, which I very much like. I am glad that you have arranged things as I had wanted them. But a doubt lingers in my mind about this village, and as a satyagrahi I should tell you the thought that occurs to me. Of course it is not practical wisdom in a man to speak out all that he thinks. Still, for my part, I regard myself a very practical man. One should have nothing to do with the practical wisdom which goes against the world’s welfare. My co-workers or I have lost nothing through this attitude of mine. I wonder if you thought that, since there were five Antyajas, and possibly some Muslims, accompanying me on this campaign, it would be best to lodge me and my party outside the village. I hope you have not been clever and thus quietly avoided trouble. I first asked people to inquire about this, but subsequently decided to put the question to the meeting here. I am determined to reach Jalalpur, having given you all that I have. Those accompanying me are only students. A true studentalways hungers for knowledge, which he seeks to garner with the world as his school and with nature and mankind as his books. Many saints were illiterate, but they had trained themselves in the art of thinking and so they were students. I even sent some students to inspect the Antyaja locality here. This fight is based on truth and non-violence and, therefore, we are true satyagrahis. And I ask you to believe me when I prophesy that a day will come when the British will apologize to us. Shri Vallabhbhai turned nights into days and rendered help to the British. He served the people, and the Government is repaying him now by arresting and removing him away from us. I tell you, though the Government has been able to imprison for the present a man like Vallabhbhai it will have to apologize to him. Of course he does not care that he has been arrested. To me, he was my hands and feet. Had he not worked and prepared the ground here in this district, I could not have mustered the courage to speak these few words before you. What is going to be your reply to the salt law? All of you have to reform yourselves and offer a fight to the Government. We can prepare ourselves to win complete freedom by serving our Antyaja brethren. I should be happy if my doubt about your village is ill-founded. May you serve one and all without exception. Abolition of the salt tax or remission of some other taxes will not mean swaraj for us. Winning swaraj is not going to be so easy as that. That is only a way to it and by following it we shall reach the goal of freedom. It is indeed a good thing that the Headmen of Navagam, Vavdi, Agam, Mahelaj and other villages have tendered their resignations. Why should they stick to Headmanship for the mere five rupees a month that the Government pays them? If the Collector summons a Headman, let him say, “Give us back our Sardar. Grant us a remission in land revenue.” To give up Government service is to exorcise an evil spirit haunting the home. In resigning his job, your Headman has done a meritorious deed. When we have a people’s Government, we shall see what to do. Satyagraha means disobedience to every law of the Government. Disobedience of the salt law is one item of such satyagraha. Such disobedience is our duty; it is our right. In the fight for that right, I need your help, not in the form of money but of volunteers to break the law. The next item on my programme is khadi. How shameful that your village shows a zero against the columns for the number of spinning-wheels and khadi-wearers! If you have not been wearingkhadi hitherto, wake up and begin now. I appeal to you to help our poor country by using khadi. It is my wish that there should be none among you who does not wear khadi, I earnestly ask you to be dressed in khadi clothes. For women, spinning used to be a yajna. There were five such yajnas. The first was the kitchen fire. Performing that yajna, my mother set apart a go-grasa, a morsel for the cow. The second was the quern, the third was the broom, the fourth the spinning-wheel and the fifth was fetching water. Now all these yajnas are on the wane, because selfishness has crept in among us. If you wish to follow the path of dharma, start again the spinning-wheel sacrifice and follow the good sense that God has bestowed on you.",
        "date": "March 14, 1930",
        "source": "[From Gujarati] Prajabandhu, 16-3-1930"
    },
    {
        "speech": "speech at dabhan",
        "text": "I have come to know that a Headman, a Matadar and a watchman of Kanakapura have submitted their resignations. I hope that you have handed in those resignations willingly and that none of you will yield if any of the officials intimidates you and that you would not, seeking pardon, withdraw them. When we have once taken a vow, we shall not withdraw them even if we die.3 Your Headman has submitted his resignation but his old uncle has registered himself as a volunteer. It is not that only young people can join this struggle. This is a religious as also a non-violent struggle and even children can take part in it. The names of some women have also been received by me. I have received names even of children below the age of fifteen and I do not hesitate to mention them. I have received names of many more old men also and they say that it is better to die in jail than outside it, but only out of thoughtfulness I do not take them along with me. On reaching Dandi, we shall call them first and send them first to jail. I hope that the Headmen and Matadars from the neighbouring villages also will send in their resignations. Although we claim to practise cow-protection, we should now call it buffalo-protection or service to buffaloes. In this town of Dabhan, there are three hundred buffaloes as against three cows. This suggests that we are ignorant of animal husbandry. In this district, it is difficult to obtain cow’s milk or ghee for sick persons or for those who have taken the vow to serve only the cow. Goseva does not mean saving the cows from Muslims or Englishmen— this amounts to cow-slaughter. That is a misinterpretation of the term goseva.1 The number of cows sent to Australia to be slaughtered is a hundred times the number that are slaughtered in India by the Muslims. If you desire to see to it that cows are not exported abroad, you should all train yourselves in animal husbandry and act in accordance with that science. I do not recall the taste of buffalo’s milk. Hence I cannot distinguish it from cow’s milk. However, doctors have testified that buffalo’s milk and ghee are not as nourishing as those of the cow and Europeans do not even touch the milk of the buffalo. Ours is a holy war. It is a non-violent struggle. Even women and children can take part in it. The soldiers of satyagraha will never do what the ordinary soldiers do. Your village consumes 800 maunds of salt a year, and thus pays money to the Government without reason. The Government appropriates to itself all the taxes you pay without making any return to you. We wish to throw off that burden and hence we demand complete freedom. If you feel strong enough, give up Government jobs, enlist yourselves as soldiers in this salt satyagraha, burn your foreign cloth and wear khadi. Give up liquor. There are many things within your power through which you can secure the keys which will open the gates of freedom.2",
        "date": "[March 15, 1930]",
        "source": "[From Gujarati] Prajabandhu, 16-3-1930, Navajivan, 30-3-1930, and Gujarati; 23-3-1930"
    },
    {
        "speech": "speech at nadiad",
        "text": "I have visited Nadiad often and made many speeches here, but never before did I see such a huge mass of men. Bound by the chains of slavery, we are being crushed at present, and we want to shake them off. I am sure you have come here today not for my sake or for the sake of my troop of eighty, but because you hunger for complete freedom. Since I left Ahmedabad, on my way here large numbers have showered their blessings on me and my mission. The showers have swelled into a flood, as it were. You, too, are witnessing the same thing. Vallabhbhai’s services to Kheda District have been many and various. At the time of the floods he saved thousands of men. That Vallabhbhai is now behind the prison bars. I too have done some work in this district. You have, therefore, a threefold duty to discharge. The imprisonment of Vallabhbhai is your imprisonment. Arresting him in Kheda is arresting Kheda itself. Of course by imprisoning Vallabhbhai the Government has honoured him, but you it has insulted. What is to be your reply to this insult? Your reply can only be winning complete freedom. How could you do that? Only by following my path. That is as clear as the rule of three. I wish all Government servants to give up their jobs. What is Government service worth after all? A Government job gives you the power to tyrannize over others. And what do you earn in the job? By dint of independent labour a man can earn thousands if he chooses to do so. The local Headman has resigned his post. But is that enough? Nadiad produced Govardhanram and Manilal Nabhubhai. It has been a city of men of letters. Are there any heirs of these learned men now? What is the duty of the students in this city of learned men? And the duty of their sisters and mothers? It is up to you all to give a reply to these questions. You all have to enlist yourselves as volunteers. As soon as I get behind the bars or as soon as the All-India Congress Committee gives a call, you should come forward to offer yourselves for being jailed. Then alone shall I believe that Nadiad has made its contribution to our struggle. Nadiad is thirty-one thousand strong. You spend three hundred and ten thousand rupees on cloth year after year. Instead of letting this wealth flow out of the city, what a gain it will be if you keep it in your homes! You will then have obeyed the most beautiful law of nature. That is the simple calculation I ask the heirs of Govardhanram and Manilal to make. If they do not do so, they would be bringing disgrace on the good name of Nadiad. Will not Nadiad, the pride of Gujarat, do even this much? May God grant you the strength to do it.",
        "date": "March 15, 1930",
        "source": "[From Gujarati] Gujarati, 23-3-1930"
    },
    {
        "speech": "speech at boriavi",
        "text": "In this peaceful struggle there is no room for coercion of any kind. We will coerce no Englishmen nor any of our countrymen. I do not want anyone to resign under compulsion. Resignations tendered under duress or in awe of somebody ought to be withdrawn. They have jailed your Sardar, that is, they have taken from you swaraj itself. We must get him released from prison and, you will have proved your strength if you can see to it that he is out in one month instead of after three. After Vallabhbhai is released, take care that you do not apologize and withdraw your resignations. You can withdraw the resignations and become Headmen again only when we get control of the Government. If you drink liquor, tea, etc., and still think that Gandhi who has gone to battle with his band will bring you swaraj, you are making a mistake. Gandhi will leave for ever and his troop will be lost in the sea. Swaraj can be won only if you all take up constructive work. Those of you who do not enlist as soldiers of swaraj should at least wear khadi.",
        "date": "March 16, 1930",
        "source": "[From Gujarati] Prajabandhu, 23-3-1930"
    },
    {
        "speech": "speech at anand",
        "text": "You have just heard Panditji sing that the path of love is like a flame. A satygrahi’s path is the path of love, not one of enmity. It should be the ambition of a satyagrahi to win over even the most hard-hearted of enemies through love. How can one demonstrate that there is nothing but love underlying civil disobedience? Pritam must have had a direct experience of this, as a result of which this bhajan poured forth from his heart. Ill feeling perhaps could be compared to fire. How could that be said of love? Whereas ill feeling burns others, love burns oneself and purifies the other person. When love assumes this intense form, it may well appear to some as fire, but you may be sure that in the end it will make its cooling effect known. This band of satyagrahis which has set out is not staging a play; its effect will not be merely temporary; even through death, it will prove true to its pledge—if death becomes necessary. The Government will, in the end, have to admit that these persons practising satyagraha were devotees of truth and non-violence. Nothing will be better than if this band of satyagrahis perishes. If the satyagrahis meet with death, it will put a seal upon their claim. None of us can assert today whether we have the strength to die a satyagrahi’s death. To stab someone in the abdomen in a fit of rage or to die harbouring anger in heart, but keeping up an appearance of non-violence through shame is not to die a satyagrahi’s death. Not only should there be no anger within one’s heart at the time of death, but on the contrary, one should feel and pray: ‘May good befall him who kills me !’ When anyone meets death in such a manner, I would call it a satyagrahi’s death and only in such a death would the dying person be considered to have been true to his pledge. Even with regard to myself I cannot give anyassurance today. It is only others who can judge a person by this test after his death. Here in Anand, you have Narsinhbhai’s hut. Anand is the educational centre of the Patidars. Kheda district is the home town of the Patidars of Vallabhbhai, of Motibhai Amin, and of the volunteers of the Charotar Education Society. Where can I give expression to the feelings within me if not before such an audience? I have come to you filled with great expectations. I have asserted at many places that this time I have not set out to beg for funds. I know how to do that. This struggle is not one based on money. It is going to be carried on without it. In a trice this morning, the yarn merchants of Bombay presented me with Rs. 2,501. The Diamond Association has sent me Rs. 2,000. Moreover, if I make even a feeble appeal for funds, Gujarat and India would shower money upon me; I would be buried under its weight and would be unable even to reach Jalalpur. I have come to ask for a big contribution. In your hands lies the honour of the Patidars of Charotar. You are like salt in the sea of Patidars. If the salt loses its savour, wherewith shall it be salted? Salt is more sapid than either sugar or jaggery. The latter may even cause jaundice, whereas a pinch of salt adds flavour to the meal. If Anand gives up its savour, if courage and such other virtues which have been attributed to the Patidars are not displayed in Anand at this juncture, where else can one see them? You must have understood the reason for this introduction. Are the students of Anand and Kheda district going to sit down with their books, or will they follow the lead that has been given by the Vidyapith? We have already received a return with interest for the 2_ lakhs of rupees spent by Dr. Mehta for the Vidyapith and contributions made by other well-wishers. Today the Vidyapith has wound up its book-learning and has proved its motto: That is learning which liberates. All the students who have entered their sixteenth year have united in giving up their studies, and the teachers too have joined them. What more can be expected of a place where all the students as well as the teachers obtain cent per cent marks? Why do you also not adopt this path? It is my hope that Gujarat will set an object-lesson to the rest of the country. One cannot say yet whether the fight will be a prolonged one or will end quickly. If, however, we have sacrificed our all in the movement, we should not worry about whether it will be long or short. I have a right to entertain such hopes of the Patidars of Kheda district. They have been giving me hopes ever since my South Africa days. Kheda district has a population of seven lakhs which includes our Thakore brethren. If the Patidars show the way, the Garasias are bound to follow them. Has not Tulsidas said that base metal shines at the touch of the parasmani1. You students must suspend your studies for as long as this struggle continues. At this time, I recall the words of the late Deshbandhu. He was unhappy about non-co-operation in schools. He used to say that we should certainly call out students when the time came for the final struggle but that we should leave them alone at the moment. I did not agree, and he joined in the boycott of schools. But these words were uttered in 1920. Not five, but ten years have elapsed since then. The final battle has to be waged. Hence there is no reason why students should now remain in schools. Today I am not asking for preparing one battlefield only. Today, everyone from Kanyakumari to Kashmir and from Karachi to Dibrugarh will be able to practise non-co-operation either individually or collectively. Until last December, I felt that the atmosphere was not favourable for civil disobedience and I said what I felt. I now claim that if ever the circumstances were opportune, they are today. This is the auspicious moment. If at this auspicious time we do not develop the strength for civil disobedience we shall never do so. What student is he who will continue to study at such a time? Formerly, I asked the students to leave schools and to set up national schools. Today I ask them to leave schools and come out on the battlefield and become mendicants for the sake of the country. If a business man continues to carry on his business today, he will not enhance his prestige. If India wishes to launch satyagraha on a wide scale, this is the time when it should do so. God will provide food and drink; countless people will provide it. If there is a flare-up in the entire country, and if the whole of India starts practising civil disobedience, how long will it take for 30 crores of people to free themselves from the grip—the domination—of a hundred thousand Britishers? School children will work this out by the rule of three. The army consists of 70 thousand Britishers and others including Sikhs, Pathans, Gurkhas and Marathas. This army is sitting astride both our shoulders; although it may be stationed in Meerut and other cantonments, we see nothing else behind the laws that suppress us. The British make us dance to their tune on the strength of the backing of this army. Please remember again I am not asking you to give up your studies for good, but only to give up book-learning while the struggle lasts. It is up to you whether it will be a protracted one or not. Youth leagues—that is you students—proclaim many big things. This year our Congress President is a young man who rides a horse. Hence a large part of the burden of this struggle is to be borne by you students. May God give you inner strength. This is not a question of utilizing your intellect. If something has to be made convincing through the use of the intellect, it can be set out in the same manner as a proposition of geometry with a Q.E.D. at the end of it. However, here the intellect becomes helpless if there is no strength of heart. The intellect is a handmaid of the heart. I am helpless, however, if you feel at heart that this man has only begun a stunt, that at the end of a month he will call the thing off saying he has committed a Himalayan blunder and withdraw quietly to the banks of Sabarmati. If, however, you do not believe this to be the case, rest assured that so far as you and I are concerned this is indeed the final struggle and the means to be adopted are peaceful, involving civil disobedience and so on.",
        "date": "March 17, 1930",
        "source": "[From Gujarati] Navajivan, 23-3-1930"
    },
    {
        "speech": "speech at ras",
        "text": "Today we have entered the taluka in which Sardar Vallabhbhai was arrested and sentenced to prison and in which he had carried on such a vigorous struggle in 1924 that the Government had finally to admit its error and mete out justice that should not have required a struggle. It is as if Sardar was sentenced to prison as a reward for having served you! The question now is what you can do to serve the cause for which he has been sent to jail and what I should do. Some of the Headmen and Matadars have handed in their resignations. I congratulate them. However, there are still many who cannot abandon the line. I have not come across a single person who has accepted the post of a Headman for the sake of the salary attached to it. Headmen have the privilege of perpetrating indignities on the people or it may be said that they have the right to participate in the indignities perpetrated on the people. The improper reason for their clinging to their posts is that this privilege satisfies their base self-interest or assists them in their work. But how much longer will you keep on doing your part in squeezing these villages? Have not your eyes yet been opened to the robbery that is being committed by the Government? The Headman, the Talati and the Ravania are the representatives of the Government in the villages, and it is through these persons that the latter carries on its administration. A village which is afraid of a handful of men and continues to act in a manner contrary to its own wishes, neither enhances the prestige of the Headman, the Talati or the Ravania nor that of the villagers themselves. Sardar was making great efforts to end this indignity. Sardar neither made speeches nor came here to foment trouble. Neither the Magistrate nor you had expected any sort of trouble. The task for which Sardar had approached you was not a secret to anyone. A satyagrahi has no secrets. Even a child can see how a satyagrahi stands, sits, eats and drinks. It can also examine the latter’s accounts. What secret can a satyagrahi like Sardar have? He had come here to clear the way for me. He had not come here to convey the message regarding salt. We had both so planned that it would be through me and those whom I took along with me that the salt law would be violated. You do not know many of the persons who are accompanying me. They are all public workers devoted to Sardar. I have not been able to understand the nature of Sardar’s offence. Even the Magistrate did not know it. That Sardar should be awarded a sentence of three months’ jail is a matter of shame both to Sardar and to the Government. A person like him should be sentenced to a term of seven years’ imprisonment or be exiled. It would not befit the Government to sentence me to three months’ imprisonment. Exile for life or hanging would be a punishment fit for a person like me. I am guilty of sedition. It is my dharma to commit sedition against the Government. I am teaching this dharma to the people. A regime under which tyranny is being perpetrated, under which the rich andthe poor are made to pay the same amount of tax on an item like salt, under which exorbitant sums are being spent on watchmen, the police and the army, under which the highest executive receives a salary which is five thousand times the income of the cultivator, under which an annual revenue of 25 crores of rupees is derived from narcotics and liquor, under which foreign cloth of the value of Rs. 60 crores is imported every year, and under which crores of persons continue to remain unemployed, it is one’s dharma to rise against and destroy such a regime, to pray that fire may consume it policies. For such a treasonable offence, I was once sentenced to six years’ imprisonment but, unfortunately for the Government and myself, I fell ill and I was released as it was felt that I should no longer be held in prison. Now again a cloud, if you choose to call it so, or a procession with a fanfare if you wish so to describe it, is approaching me. It will be good if I am arrested. The magistrate will be put to shame if he sentences me to three months’ imprisonment. One guilty of sedition should be banished to the Andamans, sentenced to a life-term of exile, or to hanging. What other punishment can be meted out to anyone like me who regards sedition his duty? The Government must have believed that by sentencing Sardar to three months’ imprisonment, it will be able to scare the people and suppress them. However, the fact that you have turned out here in thousands appears to signify that you are looking forward to a celebration. You must regard it as something to celebrate if my colleagues and I are arrested. But will you sit quiet after regarding this as an occasion for celebration? Will the Headmen and the Matadars cling to their offices as flies cling to dirt? That would indeed be a matter of shame and grief. Durbar has come and settled in this taluka for many years. Who is this Durbar? He has given up his kingdom—however tiny a village it may be. He does not want any comforts; he only wants to serve. You should learn courage and sacrifice from him. What an adverse impression it will create if the Headmen of such a taluka do not give up their office ! The money that you have given me today has no value for me. When I collected a crore of rupees, it did have value for me. Those crores of rupees have rendered service many times their value. Today, however, I do not need money but your services. All the men and women present here should get themselves enrolled. Say that you are prepared, when your turn comes to violate the salt law. Even women can participate in this righteous struggle and many have already enrolled themselves. This religious struggle does not involve hurting even a hair of anyone. We shall teach the Government a lesson by suffering hardships ourselves, and by doing so create world opinion in our favour. And, finally, we shall achieve a change of heart in our rulers. At present, however, the Government is inclined to indulge in oppression instead of meting out justice. A person like Shri Sen Gupta, Mayor of Calcutta, whose name is familiar to everyone in Bengal, has been imprisoned in Burma. The Government has adopted the policy of arresting those who are not guilty of any offence. At a time when the nation cries out in despair and thousands are coming forward to express their grievances, the Government should abolish a thing like the salt tax and redress other grievances as well. But this Government cannot afford to do so. It cannot afford to see a crore of rupees remaining with the people. It is behaving in such an outrageous manner in order that this sum is sent out to England. The first step towards freeing ourselves from such oppression is to seek the abolition of the salt tax. We shall violate the salt tax law to such an extent that we shall be prepared to suffer whatever the penalty we may have to face—be it imprisonment, flogging or any other.",
        "date": "March 19, 1930",
        "source": "[From Gujarati] Navajivan, 23-3-1930"
    },
    {
        "speech": "speech at gajera",
        "text": "You should be firmly convinced that you have performed a meritorious deed by bringing the Antyajas in your midst and have taken a step forward towards swaraj. You can see from the dress and behaviour of the two Brahmins who sang “ Raghupati Raghava Rajaram, Patitapavana Seetaram” , that they are not new-fashioned Brahmins, that they are persons who would not gamble, eat meat or be guilty of licentious conduct. They are Brahmin teachers who are well-versed in the Gita, know Sanskrit and fully understand their responsibilities. They do not regard it as a sin to live with the Antyajas or with those who belong to other religions, but rather look upon it as a sin not to do so. Hence, you should be convinced that you are not guilty of irreligious conduct. When Shri Ramachandra left Ayodhya and arrived on the banks of the Ganga, King Nishad rowed him across to the other bank, and offered him fruits and vegetables to eat. Who was Nishad? He was regarded an Antyaja. When Bharata met him, he embraced him and congratulated him on having served Shri Ramachandra in his hour of need. There is an Antyaja family which has also joined our group. Besides the 60 crores of rupees that go out of the country every year by way of payment for the foreign cloth that we import, millions more are sent out of the country. During the days of the Gazni, Ghori, and the Mogul Empire, the wealth of the country stayed within it, but under this Government, the pensions of all officers are sent out of the country. How can one rest when the country is being robbed in this manner? There are three hundred districts in India and in all these districts the Collector reigns supreme. It is truly a matter of shame to them and to all of us, if we only stop to think, that these three hundred men should rule over 30 crores of us.",
        "date": "March 21, 1930",
        "source": "[From Gujarati] Navajivan, 30-3-1930"
    },
    {
        "speech": "speech at ankhi",
        "text": "I have received a complaint that villagers do not supply provisions or water to the police officers or other Government officers who happen to come here. We are not guilty of any violence in doing so; however, whether these officers happen to be Indians or Britishers, if they are really dying of hunger or thirst, it is not our dharma to let them perish in either manner. The dharma in obedience to which I act and which has made an outlaw of me teaches me that if Dyer and O’Dwyer, whose deeds, which were the very incarnations of cruelty, I had termed as “Dyerism”, shoot me and if I am still conscious and come to know that one of them has been bitten by a snake, I would go running to them to suck out the poison. I have done such things in the past. In South Africa once I was beaten by a certain person1 and when I regained consciousness, I beseeched the Government to releasehim. However, if an officer approaches us with arrogance which derives from the office he holds, he would get neither food nor drink, neither a bed, nor matches nor even fodder for his horse. A potter is not born in order to fetch water for others. Even if we happen to lose our hands, we shall no longer salute the Government. We shall ourselves settle all our disputes and, when a new era begins, washermen, barbers and other workers will be ready to serve those who serve the people. However, in a democracy, there will be no distinctions of high and low. Even a Brahmin will become as much of a public servant as a Bhangi. [From Gujarati]",
        "date": "March 21, 1930",
        "source": "Navajivan, 30-3-1930"
    },
    {
        "speech": "speech at buva",
        "text": "Although I make strong speeches and have set out to violate the law, the Government dare not arrest me. Why are you afraid of such a Government? The Government took Shri Sen Gupta to Rangoon and sentenced him to about 10 days’ simple imprisonment. Should we not conclude from this that as compared to 1857 and 1919, it has lost some of its strength? I have only 80 volunteers with me. Even then the Government cannot arrest me. What then could it do if there were 80,000 volunteers? Hence Hindus and Muslims, men and women, should participate in this struggle.",
        "date": "March 23, 1930",
        "source": "[From Gujarati] Gujarati, 30-3-1930"
    },
    {
        "speech": "speech at samni",
        "text": "To date, at least 80 persons have handed in their resignations. It will be regarded as cowardice to hand in one’s resignation and then to withdraw it. There is no compulsion to resign. It is advisable to give up the post of Headman, looking upon it as something base, dirty and filthy. In the Ashram, classes have been started to train up women in fifteen days. Dadabhai’s grand-daughter2 is a teacher there. The women of Samni should also come forward. If you cannot do so, will you not at least produce khadi? Nowadays a large number of people wear khadi. But if those who make it go to jail, who will continue to produce khadi? You should therefore produce khadi.",
        "date": "March 23, 1930",
        "source": "[From Gujarati] Prajabandhu, 30-3-1930"
    },
    {
        "speech": "speech at public meeting, tralsa",
        "text": "Mahatmaji said he heard that some Muslim friends had complained that he and his party did not pass through their villages. If he was invited he would surely have included such villages in his programme but his present tour was such that he could not go to any village uninvited and he could not force the villagers to receive him. In Dandi, a Muslim has invited me and I will be putting up in his bungalow. Satyagraha will commence from the Muslim friend’s house. My Muslim friends should not, therefore, feel aggrieved. I only want their blessings so that I may achieve success in my religious fight. Muslims and Hindus both want that this tax should go as both consume equal quantity of salt and both feel the pinch. Only when they are able to get the tax abrogated, will they get enough strength to get swaraj. They must know that crores are being sent away to England by various means. Making a passing reference to the Sarda Act, Gandhiji said they need not be afraid of that Bill. He could not think of the Government interfering in such things but the people also should understand that nothing is gained by marrying their children of tender age. This is not the time for marriages when this fight is going on. They must not put any restraint on their sons but all this abysmal ignorance is due to our bondage and dependence.",
        "date": "March 25, 1930",
        "source": "[From Gujarati] The Bombay Chronicle, 26-3-1930"
    },
    {
        "speech": "speech at broach",
        "text": "Chandubhai has asked for my blessings. But who am I to give blessings? I have myself come to seek blessings. I hope that by the time I reach Dandi the blessings I am receiving at every village on this march will have added up to such a mountain that even this monster of a Government will cower at the sight.2 A Muslim youth has sent me questions on the Hindu-Muslim problem. One of them is: “Do you expect to win swaraj through your own single effort or assisted merely by the Hindus?” I have never dreamt that I could win swaraj merely through my effort or assisted only by the Hindus. I stand in need of the assistance of Mussalmans, Parsis, Christians, Sikhs, Jews and all other Indians. I need the assistance even of Englishmen. But I know too that all this combined assistance is worthless if I have not one other assistance, that is, from God. All is vain without His help. And if He is with this struggle, no other help is necessary. But to realize His help and guidance in this struggle, I need your blessings, the blessings of all communities. The blessings of thousands of men and women belonging to all communities that have attended this march are to me a visible sign of the hand of God in this struggle. I know that there are occasions when the hand of God has to be traced in the curses of men. But this is not such an occasion. Today I am doing what the nation has been yearning for during the past ten years. Have I not been rebuked for delaying civil resistance? Have not friends angrily said, “You are stopping the progress of the nation towards its goal? You have only to say, ‘Let there be civil resistance’, behold ! there is swaraj.” There is some truth in the taunt. Full civil resistance does mean swaraj. But I was staying my hand. I had no confidence in myself. I was straining my ear tolisten to the still small voice within, but only up to yesterday there was no response. It was in Lahore I had told a journalist that I saw nothing on the horizon to warrant civil resistance. But studdenly, as in a flash, I saw the light in the Ashram. Self-confidence returned. Englishmen and some Indian critics have been warning me against the hazard. But the voice within is clear I must put forth all my effort or retire altogether and for all time from public life. I feel that now is the time or it will be never. And so I am out for battle and am seeking help on bended knees from this white beard1 as also the little girls. For in this battle even they can help; and thank God, they are eager to do so. I have insistent letters from them demanding enlistment. Thus the answer to the Muslim youth’s question is complete. I need the help of all races and from all climes. A satyagrahi has no power he can call his own. All the power he may seem to possess is from and of God. He therefore moves towards his goal carrying the world’s opinion with him. Without the help of God he is lame, blind, groping. Ever since 1921 I have been reiterating two words, “self-purification” and “self-sacrifice”. God will not assist him without these two. The world is touched by sacrifice. It does not then discriminate about the merits of a cause. Not so God. He is all-seeing. He insists on the purity of the cause and on adequate sacrifice therefor. The question was put by a Mussalman representing a powerful interest. But had a little Parsi girl representing but a hundred thousand Parsis asked the question, I should have given the same answer and said: “Without the help of Parsis there is no swaraj.” I am thankful to be able to say that I have had during the march abundant proof of the blessings of these communities. I have read friendliness in the eyes and in the speech of the Mussalmans who along with the rest have lined our route or attended the meetings. They have even given material aid. Yet I know that I have not the Ali Brothers with me. Maulana Shaukat Ali will no longer have me in his pocket. Do not think, I do not miss him. I hold no distinction between him and blood brother. His resistance therefore can only be short-lived. If truth is in me, the Brothers must capitulate. They cannot long keep out of the battle. I crave too the assistance of Englishmen. It was neither empty formulanor a touch of vanity that prompted me to send an English friend with my letter to the Viceroy. But choosing Reginald Reynolds as my messenger, I sealed the bond between them and me. For my enmity is not against them, it is against their rule. I seem to be born to be an instrument to compass the end of that rule. But if a hair of an English head was touched I should feel the same grief as I should over such a mishap to my brother. I say to them as a friend: “Why will you not understand that your rule is ruining this country? It has got to be destroyed even though you may pound us to powder or drown us. We must declare what we feel.” The second question is: “Under swaraj how many seats will Mussalmans, have in the legislatures? ” What answer can I return to such a question? If I were Viceroy of India I should say to the Mussalmans, Sikhs, Christians, Parsis, etc. “Take what you like, the balance will go to the Hindus,” It is true that the Sanatani Hindu will never let me become Viceroy. The fact is that I am unfit to do such accounting. But it should be sufficient to know that the Congress has pledged itself not to accept any communal solution that does not satisfy the parties concerned. I am bound by that pledge. For the Congress all are one. They are all Indians and therefore their freedom is guaranteed. No more can be expected by any community. Civil resistance will merely give the power to the nation to assert her will. But when the time comes for its assertion, the document embodying the will will have to be sealed by all the communities. Thus without the co-operation of all communities, there is no Independence. But what should we do meanwhile? We must at least be true to the salt we eat. Her starving millions are the salt of India’s earth. To be true to them we must free the salt from a tax which they have to pay equally with the rich and in the same proportion as the rich. In our ignorance we have been paying this inhuman imposition. Having realized our folly we will be traitors to the starving millions if we submit to the exaction any longer. Who can help liking this poor man’s battle? The cruel tax is no respecter of persons. It is therefore as much the interest of the Mussalman as of the Hindu to secure its abolition. This is a fight undertaken in the name of God and for the sake of the millions of the paupers of this country.1 Who does not approve of a struggle to do away with a salt tax amounting to Rs. 6 crores? What a great hardship it is for a poor Muslim if he cannot get salt. Is there any Indian who will not participate in this struggle to get this tax repealed? This struggle is being carried on in the name of God. It is being carried on for the benefit of the poor and the needy and not for the sake of the wealthy. And is there anyone who will keep away from a struggle for the needy? I have answered the questions. Shri Chandubhai has vehemently asserted that the Broach District will contribute the largest share in this struggle and, although the people of this district may lose their lives, they will not fail to serve the people. I hope that the men and women who have assembled here will fulfil Chandubhai’s hopes. If all of them get themselves enrolled, Shri Chandubhai’s hunger will be satisfied and I shall consider that I have received more than what I had asked for. I pray to God, in Whose name I began: may He grant you the ability to understand what I have told you and the strength to act accordingly.",
        "date": "March 26, 1930",
        "source": "[From Gujarati] Navajivan, 30-3-1930"
    },
    {
        "speech": "speech at ankleshwar",
        "text": "By merely saying that a government is “foreign”, no idea is conveyed as to its nature. It may be that though a government is foreign, the plight of the people under it may not be so miserable. Although Rajpipla is an Indian State, I would regard it as “foreign” since it has such a large number of liquor booths. One can understand the Government levying a tax on ghee. Liquor or cigarettes can also be taxed. This Government is, however, so cunning, arrogant and inhuman that it levies a duty on an item which is consumed by the poorest of the poor. We are lucky, at any rate, that there is no tax on the air we breathe! There is a tax on water and the tax on salt amounts to 1,400 per cent. When people develop the strength to abolish the tax that is levied on salt, we shall not have to hear the complaint that there are so many liquor booths. The wealthy consume liquor, but they do not pay Rs. 25 crores for it; this amount comes from the pockets of the poor. Resignations have been received from Headmen. I do not, however, trust these people as some of those who have resigned have informed the Collector that they were compelled to do so. Moreover, where one person has resigned, another has taken charge. If there is such a scramble for this office, we should find out whether those who have resigned have actually relinquished charge.",
        "date": "March 26, 1930",
        "source": "[From Gujarati] Prajabandhu, 30-3-1930"
    },
    {
        "speech": "speech at sajod",
        "text": "Tomorrow morning the tour of the Broach District will be over, and it will be proper to sum up my impressions at this place. If we are to depend for swaraj on what has been done so far, it will take us very long to win it, because it cannot be secured by mere attendance at meetings or by large numbers joining the civil disobedience movement against the salt tax. The achievement in the field of constructive work is very meagre in other districts indeed, but here also it is just as poor. We have not achieved complete boycott of foreign cloth and have not succeeded in popularizing khadi. The entry in the column for the quantity of khadi produced is nil. You have a rich crop of cotton in this district, but you put it to no use yourselves. Consumption of liquor has spread widely. Even in these circumstances, however, I have the hope that this movement will bring about a great awakening among us. The use of khadi is spreading widely in the whole of India. If, in consequence of this, there is shortage of khadi, you can even help in producing more of it. After I leave this place they may or may not let me reach Dandi, but take it from me that the salt tax is gone. If you start doing all that I have suggested, I believe we shall have stormed and won not merely the fort of the salt tax but many other forts as well. As I have the blessings of you all, this monstrous salt tax—no adjectives can be strong enough to describe it—is bound to be abolished. If you produce and spread the required climate by boycotting foreign cloth, we will win the next fort. That is, we shall win Rs. 60 crores. Through liquor and opium we have been throwing away Rs. 25 crores for the privilege of becoming mad. That third fort also we will certainly win, but only if you give up drinking. Rs. 60 crores for foreign cloth, Rs. 25 crores for intoxicants and Rs. 6 crores for the salt tax—if we save all this money our faces will beam with lustre and swaraj will be won in no time. The salt tax is as good as gone, and hence those ofyou who do not wish to join the present movement should all co-operate and help in these two matters. I request all brothers and sisters here to give up foreign cloth and wear khadi. Understand what your true duty is.",
        "date": "March 27, 1930",
        "source": "[From Gujarati] Prajabandhu, 30-3-1930"
    },
    {
        "speech": "speech at mangaro",
        "text": "Let us be under no delusion. As long as we accept the presence of God’s hand behind all things, we may keep up our courage and self-confidence and believe the abolition of salt tax a certainty. So far we had been untrue to our salt, but now we must be true to it. It was only on the 12th that we started talking about breaking the salt law. But we have been speaking of two or three other things since 1920. If you remember, according to the Bezwada Congress programme, we were to have two million spinning-wheels working and to boycott all foreign cloth. How much of that have we accomplished? This is a painful, shameful thing. The same can be said about the drink habit. Liquor is being freely consumed. In regard to these two, we believe that we shall be able to enforce them only when we have captured power. But take it from me that the power to remove this Government will drop into our hands when we do away with the evils of foreign cloth and liquor. If we mean to work, here is work for us. All men in this village eat salt; let them manufacture salt for their own use. Even children should openly steal salt, as it were. Let us burn foreign cloth and buy khadi to wear in its place, or manufacture it with our own hands. At the same time, we should see the licenceholders running liquor booths and persuade them to close the booths. We shall then enjoy fighting for swaraj and become really interested in swaraj. We shall win it only when we do all these things. The fight may start even before the 6th of next month. It only awaits my arrest. No sooner do they arrest me than you should start making salt. When I am arrested, you may do with only a loin-cloth but wear no foreign cloth at all. I repeat even today my old slogan: swaraj hangs by the hand-spun yarn and the khadi woven from it.",
        "date": "March 27, 1930",
        "source": "[From Gujarati] Prajabandhu, 30-3-1930"
    },
    {
        "speech": "speech at rayma",
        "text": "I cannot live in a district where salt cannot be prepared. So although I am conscious of the affection you have all shown me I have to proceed to Dandi. Although I find it difficult to leave this district, I must go to Dandi and break the law. If on the 12th we can oppose this tax with the blessings of all, Hindus, Muslims, Christians and Parsis, we may take the law as abolished. All of you, Hindus and Muslims, should unite and start making large quantities of salt on the 6th. If the Government chooses to do so, it can even levy a tax on the mud that is dug out of the ground; so why should we pay this tax that it levies on salt? Just as poor women go about selling babul twigs which we use for cleaning our teeth, let us all set forthand sell salt to everyone. Shall we not even do this much for the poor millions? History has no instance of a tax as cruel as the salt tax. However, we shall not secure swaraj as soon as the salt duty is abolished. We have to become alert and do other things. We have to get rid of foreign cloth. It is not enough that we wear khadi made in the Punjab. Every one of us should spin for himself and have cloth made out of that yarn. It is our stupidity that we do not all—from children to old men —engage ourselves in this simple and beautiful task. This bespeaks disloyalty towards our country. We can win swaraj immediately by getting rid of foreign cloth and liquor. After having won independence for India, we shall carry out our tasks from the seat of office. Hence by participating in this salt satyagraha and by accomplishing these two other objectives—the latter by those who cannot participate in the struggle itself—you should demonstrate the fact that the Broach district is wholly engaged in India’s freedom struggle.",
        "date": "March 28, 1930",
        "source": "[From Gujarati] Prajabandhu, 30-3-1930"
    },
    {
        "speech": "speech to volunteers",
        "text": "This is the last week of our pilgrimage. At its very beginning, let us all wash away our sins. We have come across a river while crossing the boundary of each district. We regard a river as sacred. A river is after all an external sign of purification. We should become pure even with its help, we should become humble. We have looked upon Dandi as Hardwar. Let us become worthy of entering a place as holy as Hardwar.",
        "date": "March 28, 1930",
        "source": "[From Gujarati] Navajivan, 13-4-1930"
    },
    {
        "speech": "speech at umrachhi",
        "text": "If a man wishes to undertake a march at the age of sixty-one, he should go to the Himalayas, so that he can at least attain moksha, at least have darshan of God. But I have learnt an opposite dharma. I want to have this darshan through this march only. After having had darshan of you, I beg you also to participate in it. This is so because so long as we do not succeed in overthrowing the Satanic Government that exists in the country, we are all participants in it. Such participants will not attain moksha even if they go to Dhaulagiri. The darshan of God is fraught with difficulties. He dwells in the hearts of thirty crores of people. If you wish to catch a glimpse of Him there, you should establish total identification with their hearts. These thirty crores include all the skeletons of Orissa, Muslims, Parsis, Christians, Sikhs, men and women. We shall continue to be atheists and not believers so long as we do not achieve this unity with every section of the community. Hence I thought to myself that even at the age of sixty-one, I must not rest in peace. How can there be any rest for me so long as this Empire is not destroyed? Until today I held my peace; I used to listen to and suffer hosts of friends. I was afraid lest people take to the wrong path. What if people did not listen to me? I felt, however, that I was a coward. This was a weakness of my spirit. What right did I have to distrust people?",
        "date": "March 28, 1930",
        "source": "[From Gujarati] Navajivan, 6-4-1930"
    },
    {
        "speech": "speech at bhatgam",
        "text": "I have been asked to deliver a sermon. I have little fitness for the task. But tonight I propose to make a confession and turn the searchlight inward. You may call this introspection a sermon if you like. India in general and you in particular are acquainted with one part of my nature. Moreover, more than in any other part of Gujarat, in this district are concentrated workers who have come in closest touch with me. They know this habit of mine from personal experience. I am plain-spoken. I have not hesitated to describe the mountain-high faults of the Government in appropriate language. And I have not hesitated often to picture as mountain-high our faults appearing to us as trifling. You know, the common rule is to see our own big lapses as tiny nothings. And when we do realize our blemishes somewhat, we at once pass them on to the broad shoulders of God and say He will take care of them; and then with safety thus assured we proceed from lapse to lapse. But as you know I have disregarded this rule for years. So doing, I have hurt the feelings of many friends and even lost some of them. Tonight I have to repeat the painful operation.2 I have already told the group of people who are accompanying me that this is the last week of our march. As we shall reach our destination next Saturday, we shall not have to march any further. But we shall be faced with another task. During this last week we shall have to go through Surat district. Only this morning at prayer time I was telling my companions that as we had entered the district in which we were to offer civil disobedience, we should insist on greater purification and intenser dedication. I warned them that as the district was more organized and contained many intimate co-workers, there wasevery likelihood of our being pampered. I warned them against succumbing to their pampering. We are not angels. We are very weak, easily tempted. There are many lapses to our debit. God is great. Even today some were discovered. One defaulter confessed his lapse himself whilst I was brooding over the lapses of the pilgrims. I discovered that my warning was given none too soon. The local workers had ordered milk from Surat to be brought in a motor lorry and they had incurred other expenses which I could not justify. I therefore spoke strongly about them. But that did not allay my grief. On the contrary it increased with the contemplation of the wrongs done. In the light of these discoveries, what right had I to write to the Viceroy the letter in which I have severely criticized his salary which is more than 5,000 times our average income? How could he possibly do justice to that salary? And how can we tolerate his getting a salary out of all proportion to our income? But he is individually not to be blamed for it. He has no need for it. God has made him a wealthy man. I have suggested in my letter that probably the whole of his salary is spent in charity. I have since learnt that my guess is largely likely to be true. Even so, of course, I should resist the giving of such a large salary. I could not vote Rs. 21,000 per month, not perhaps even Rs. 2,100 per month. But when could I offer such resistance? Certainly not if I was myself taking from the people an unconscionable toll. I could resist it only if my living bore some correspondence with the average income of the people. We are marching in the name of God. We profess to act on behalf of the hungry, the naked and the unemployed. I have no right to criticize the Viceregal salary if we are costing the country, say, fifty times seven pice, the average daily income of our people. I have asked the workers to furnish me with an account of the expenses. And the way things are going, I should not be surprised if each of us is costing something near fifty times seven pice. What else can be the result if they will fetch for me from whatever source possible, the choicest oranges and grapes, if they will bring 120 when I should want 12 oranges, if when I need one pound of milk, they will produce three? What else can be the result if we would take all the dainties you may place before us under the excuse that we would hurt your feeling if we did not take them? You give us guavas and grapes and we eat them because they are a free gift from a princely farmer. And then imagine me with an easy conscience writing the Viceregal letter on costly glazed paper with a fountain pen, a free gift from some accommodating friend!Will this behove you and me? Can letter so written produce the slightest effect? To live thus would be to illustrate the immortal verse of Akho Bhagat, who says that “stolen food is like eating unprocessed mercury”. And to live above the means befitting a poor country is to live on stolen food. This battle can never be won by living on stolen food. Nor did I bargain to set out on this march for living above our means. We expect thousands of volunteers to respond to the call. It will be impossible to keep them on extravagant terms. My life has become so busy that I get little time to come in close touch even with the eighty companions so as to be able to identify them individually. There was therefore no course open to me but to unburden my soul in public. I expect you to understand the central point of my message. If you have not, there is no hope of swaraj through the present effort. We must become real trustees of the dumb millions. I have exposed our weaknesses to the public gaze. I have not yet given you all the details, but I have told you enough to enable you to realize our unworthiness to write the letter to the Viceroy. Now the local co-workers will understand my agony. Weak, ever exposed to temptations, ever failing, why will you tempt us and pamper us? We may not introduce these incandescent burners in our villages. It is enough that one hundred thousand men prey upon three hundred millions. But how will it be when we begin to prey upon one another? In that event dogs will lick our corpses. These lights are merely a sample of the extravagance I have in mind. My purpose is to wake you up from torpor. Let the volunteers account for every pice spent. I am more capable of offering satyagraha against ourselves than against the Government. I have taken many years before embarking upon civil resistance against the Government. But I should not take as many days for offering it against ourselves. The risk to be incurred is nothing compared to what has to be incurred in the present satyagraha. Therefore in your hospitality towards servants like us, I would have you to be miserly rather than lavish. I shall not complain of unavoidable absence of things. In order to procure goat’s milk for me you may not deprive poor women of milk for their children. It would be like poison if you did. Nor may milk and vegetables be brought from Surat. We can do without them if necessary. Do not resort to motor-cars on the slightest pretext. The rule is, do not ride if you can walk. This is not a battle to be conducted with money. It will be impossible to sustain a mass movement with money. Anywayit is beyond me to conduct the campaign with a lavish display of money. Extravagance has no room in this campaign. If we cannot gather crowds unless we carry on a hurricane expensive propaganda, I would be satisfied to address half a dozen men and women.1 It will be said that in that case reports will not appear in newspapers. I wish to tell you once and for all that this campaign will not succeed through newspaper reports, but with the assistance of Shri Rama. And, no light is necessary when we are near Him; neither are pen and ink and such other accessories required, nor even speech. An appeal can be made to Him even if one has lost one’s limbs. We may not consider anybody low. I observed that you had provided for the night journey a heavy kerosene burner mounted on a stool which a poor labourer carried on his head. This was a humiliating sight. This man was being goaded to walk fast. I could not bear the sight. I therefore put on speed and outraced the whole company. But it was no use. The man was made to run after me. The humiliation was complete. If the weight had to be carried, I should have loved to see someone among ourselves carrying it. We would then soon dispense both with the stool and the burner. No labourer would carry such a load on his head. We rightly object to begar (forced labour). But what was this if it was not begar? Remember that in swaraj we would expect one drawn from the so-called lower class to preside over India’s destiny. If then we do not quickly mend our ways, there is no swaraj such as you and I have put before the people. From my outpouring you may not infer that I shall weaken in my resolve to carry on the struggle. It will continue no matter how co-workers or others act. For me there is no turning back whether I am alone or joined by thousands. I would rather die a dog’s death and have my bones licked by dogs than that I should return to the Ashram a broken man.1 I admit that I have not well used the money you have given out of the abundance of your love. You are entitled to regard me as one of those wretches described in the verses sung in the beginning. Shun me.",
        "date": "March 29, 1930",
        "source": "[From Gujarati] Young India, 3-4-1930"
    },
    {
        "speech": "speech in olpad taluk",
        "text": "I feel that in this struggle for freedom, the contribution of women will exceed that of men. Even today, women are making a far greater contribution to the Charkha Sangh. It is the women who operate the one lakh or one lakh and a half spinning-wheels that are plying in fifteen hundred villages. It is on account of the skill of women that we can get the fine khadi made in Andhra. I tell you that it is absolutely true to say that swaraj is tied to a strand of yarn. These are the words of Brahma. Hence, whether we wish to boycott foreign cloth through the means of khadi or through mill-made cloth, it is women who are the spinners. Therefore, it is women who will play a larger part in the non-violent struggle for swaraj and children of the future will say that it was their mothers and sisters who had played the more significant role. You are capable of doing this. However, you should not touch a spinning-wheel if you do not know what compassion is. Even in the cause of prohibition, if young girls come forward in the same manner as Mithubehn, you can make Olpad a dry area. If men approach drunkards, the latter will resort to obscene language; however, if young girls approach them and question them as to why they drink, ask them what indeed they are up to, whether it befits them under the influence of drink to fail to recognize a mother or a daughter, than on hearing such words steeped in affection, even the worst of drunkards will hang his head in shame and he will possibly burst into tears, and will take a vow in the name of Rama to give up liquor. But do Indian women have this moral fervour, this courage and this benevolence? However, I can provide this courage. Who will cast an evil eye on you if you walk straight on with the name of God on your lips? Be convinced at heart that purity itself is a shield.",
        "date": "On or before March 30, 1930",
        "source": "[From Gujarati] Navajivan, 6-4-1930"
    },
    {
        "speech": "speech at sandhiyer",
        "text": "I would like to congratulate yet another Talati who has handed in his resignation. Today, it is your special duty to cast away Government offices, regarding them as filth or refuse. You should practise your special dharma although you be imprisoned, hanged or have to starve. The Headmen of this place are especially loyal and ask others not to resign. They talk of unrealistic things. I humbly request them to hand in their resignations. You must carefully go through the article on this subject entitled “Limits of Boycott”1 in Navajivan, and act on it afterunderstanding its implications. As we are practising non-co-operation against the Government, to that extent we shall have to boycott it. Let me not talk of salt now. The tax is unjust and evil and has a long history behind it. The Government will not be able to say whether the imposition of this tax is moral or immoral. However, look upon it as already abolished. I make this statement depending upon your courage to fight. Swaraj will not be won as soon as this tax is abolished. Other tasks will have to be accomplished after this is done. Cloth merchants of Bombay have come here today. They have realized the importance of the boycott of foreign cloth far more than they did in 1921. My thoughts are directed only towards furthering the growth of Indian villages and Indian merchants. The latter have now realized that this struggle is as much for their benefit as for that of the poor. They alone are going to be the cloth merchants in independent India. Today theirs is an inhuman occupation, whereas under swaraj it will become a divine one. What then can merchants contribute to this struggle? They say that they will import goods from Japan and not from England. However, there are two great drawbacks in doing so. In the first place, it is not because of our enmity towards the British that we refuse to buy their cloth. We wish to eschew doing so as the Britishers want to extract money from the poor masses of India by means of trade. We should not even dream that by foreign cloth we refer to British cloth. Although you have been engaged in business so long, you have been unable to understand their cunning methods of carrying on business. Perhaps you do not know how they conquered Delhi. They are able to get all they want from even the smallest hole. That is how they captured Kashmiri Gate and became masters of Delhi. The Government of the East India Company won only after this. All this is tragic history. We should not allow a single loophole for foreign cloth through which they may make entry. No one can surpass them in betrayal. If you permit Japanese goods to be imported, Britishers will send their goods via Japan. They can do so even by giving a commission to the Japanese. Hence if you allow even a single yard of cloth to be imported from abroad, bale after bale will soon be coming in. It is the business community of India that is responsible for India losing her independence and it is through the strength of this community alone that it has to be regained. Hence those who have already put in orders should bear in mind that their cloth will be lying about like unused goods. We shall get rid of eventhese through our self-sacrifice.Now let us take the other subject of prohibition. Shrimati Mithubehn has sacrificed so much for this. Let us all join in this cause. If all this can be achieved, we can save Rs. 60 crores on foreign cloth, Rs. 25 crores on liquor and opium, and Rs. 6 crores on salt. However, in order to do so we should have the capacity for self-sacrifice, the capacity to unite and act as a group, intellectual capacity and the capacity to think. If all this is there, swaraj is near at hand. You are aware of the virtues of my colleagues as scavengers. Now today I wish to talk of women volunteers. One of them is the grand-daughter of Dadabhai. She arrived today. She went to the village of Sayan and asked for brooms. She found the entire village filthy. Dadabhai’s grand-daughter did not approve of the filth, so she started to sweep it away. The people who had not recognized her at first then recognized her and accorded her a very warm welcome. I do not speak of this example in order to give it publicity, but because it is worthy of imitation by all volunteers. Village sanitation is very essential today. Hence we are going to clean filthy villages. We have learnt from this lesson that she has brought swaraj near to us. I wish to sacrifice our women too. I wish to remind you that we have to effect self-purification. On the one hand we should practise civil disobedience, while on the other we should become progressively purer. May God give you the ability to understand all this.",
        "date": "March 30, 1930",
        "source": "[From Gujarati] Prajabandhu, 6-4-1930"
    },
    {
        "speech": "speech at delad",
        "text": "As has been said in the Gita, that which tastes bitter at first but is finally sweet is wholesome. Hence, although I was agitated yesterday and still am, I have not lost my peace; the fiery words of love which I had directed towards my friends, companions and the assembly were not regarded by them as such. Instead of the dazzling lights of yesterday I see small, dim lights of hurricane lanterns. Yesterday I did not find the outer and inner peace which I find in today’s assembly. There was an artificiality in yesterday’s lights. Ifound no affinity between those lights and our rural life. Such lights are a consequence of contact with cities, but vast numbers of villages are hundreds of miles removed from cities or railway lines. Our idea is to serve such villages. You do not even know those villages. Perhaps there are no such villages in Gujarat. But then, is Gujarat the whole of India? It is only a fraction of India. What is Gujarat as compared to Bengal, Bihar and the United Provinces? While travelling through the last-mentioned province, one does not come across even one light at night; one only hears the barking of dogs. In comparison with the houses of Gujarat, houses there seem like ruins; one feels like crying and saying, ‘O God! are there such houses in India!’ And the people there are like skeletons. They cannot even get a mattress in the severely cold winters. They bolt the doors and just lie down covering themselves with rags. I remember those villages. Could we afford to have such lights in those villages? If a wealthy person were to give me five lamps for such villages and I were to take them there I would be committing adharma and be party to the sin to that extent. At places where the houses are like rubbish heaps and people are suffering from want of food and water, if anyone gives me the money I would first of all have wells dug and get their houses repaired, I would give them cows and spinning-wheels and, if it is convenient, also get gardens laid out. But I would certainly not take money for lights. Despite this, I am aware that because of the absence of light, about 20 lakh persons die of snakebite in such villages according to Government’s figures. And there must be many others who are not accounted for! There are neither medicines nor lights to save their lives; however, I shall not dare to take such a lamp even there. That would amount to adding to their needs. That will be like giving churma1 to a person who is fasting. Once anyone has added to his needs, he would go to any lengths to satisfy them. While millions of persons do not get even half a roti and enough of inferior salt, I ask myself while I eat what right I have to eat even this much. However, owing to attachment as also in the hope of doing service, I continue to take milk. We have to consider our dharma. We want to face the might of a rakshasi empire, and this cannot be done either by looking upon it with contempt or by shouting loudly; it can only be done through the path of non-violence. Ahimsa may appear to be blind and crippled or clad in rags, but when God-given strength is addedto it, the opponent loses his strength before it, he becomes paralyzed. We have to work with such a power, and this cannot be done with lights. I have hurt my companions by dispensing with these lights. They felt that without these the people would become restless. However, in my opinion, there was no need for such fears. The message that I am conveying to you at the moment does not appear to you to be a harsh one. Lights could not have brought about this result.",
        "date": "March 30, 1930",
        "source": "[From Gujarati] Navajivan, 13-4-1930"
    },
    {
        "speech": "speech at chhaprabhatha",
        "text": "Every day people tell me, “Today you will certainly be arrested.” However, the tiger does not appear! The newspapers claim that I have become impatient at the Government not arresting me. This is partially true as it had been decided that while Sardar should remain free, I should court arrest. However, now that Sardar is in prison, I shall remain free. If we wish to secure the release of Vallabhbhai, we can only do so by carrying on this struggle. Choryasi took full advantage of the last fight of Sardar, so you must make your full contribution to this movement. The Government has acted on the principle that all places will get the rainfall of swaraj in equal measure. We certainly have the strength to secure his release. If we were determined, we might say, from a superficial glance at the villages, that swaraj was round the corner. I am not however a person who will thus deceive himself. For the present I am trying to gauge the situation. On inquiring about spinning-wheels I found a single one here. If matters are in such a state, we cannot secure Sardar’s release. We have to go forward in all directions. At present we have set out to get the salt tax abolished. We shall tire out the Government by making salt at any number of places. However, all this can be achieved only when you put into practice the aphorism that ‘swaraj lies in a strand of yarn’. The saying that it is easy to secure swaraj will only be proved true when 30 crores of people start wearing khadi and develop all aspects of swaraj, giving due consideration to rural problems. Swaraj is within our grasp if we practise this simple and easy duty. Consider how the bridge on the river Keem was built in a single night. If people act voluntarily in accordance with their capacities in this manner, swaraj is not difficult to secure. I thank all the wealthy capitalists of Bombay and Ahmedabad who have come here and contributed large amounts. I see the blessing of God in the fact that all sections of the community are helping this movement.",
        "date": "April 1, 1930",
        "source": "[From Gujarati] Prajabandhu, 6-4-1930"
    },
    {
        "speech": "speech at surat",
        "text": "There is no alternative but for us to do something about our troubles and sufferings and hence we have thought of this salt tax. You may say it is a godsend. It is so beastly and inhuman that through salt the Government taxes even little children and young girls. I have read the texts in which it is claimed that those who would carry on administration must find ways to collect taxes from all members of the public. I have gone through the holy books of Islam, Hinduism, Christianity and Zoroastrianism. All these state that women and the poor should at no time be taxed. If we go through the rules of war, we shall find that they lay down that old persons, children and women should be left untouched in war. The same is applicable to this tax. Muslims, Hindus, Parsis—all consume salt in like quantities. The Government has, however, found a device whereby all have been taxed at an equal rate. This is an inhuman law, a Satanic law. I have not heard of such justice anywhere in the world; where it prevails, I would call it inhuman, Satanic. To bow to an empire which dispenses such justice is not dharma but adharma. A man who prays to God every morning at dawn cannot, must not, pray for the good of such an empire. On the contrary while praying or saying the namaaz he should ask God to encompass the destruction of such a Satanic empire, such an inhuman government. To do so is dharma. Although I have been saying this openly for the last twenty days, the Government has left me and my colleagues free. I admit that this is a familiar trait in this Government. I have been calling this Government inhuman till today. I admit however that I do not believe even for a fraction of a second that it does not have power or authority. It has an army, it has gun-powder and it can, by merely moving a finger, destroy someone like me. But it cannot readily transgress the limits it has set for itself. It is ashamed of itself before the world. I have never in my dreams or waking moments desired and not a single one of my colleagues or the thousands of persons who have come into contact with me has ever desired, that either the King or any of the officers of this Empire should be destroyed even though we call the Empiretyrannical. This is for it something new and it does not know how to deal with it. Today, on the banks of the Tapi, I wish to tell you the very same thing that I said on the banks of the Sabarmati on the eve of my departure. Would the Government have left even one of us free if we had said that we wanted to throw so much as a pebble at officers? Some people say that I want to be arrested. I do not regard it as my dharma to get arrested; but I am not afraid of it and I am giving you the mantra that none of you should be afraid. I want that you should not be afraid of being arrested or hanged while you do your duty. I wish to convert prison into a palace. If I wished to be imprisoned I would commit theft, practise deceit, resort to assault and abuse. I would then certainly be arrested, no one would spare me. The Government would not then say ‘the Mahatma is dead; we shall not arrest him’. If the Government does arrest me, while in prison I will pray to God to bring about a change of heart in this Government and eradicate the sentiment which it has developed and which does not befit a human being. Sooner or later, it has no alternative but to arrest me and if it does not do so the whole of India will flare up within a short while. It is difficult for the Government either to imprison me or to leave me at large. Hindus, Muslims, Parsis—all should do their duty. When all of us start doing so, it will be beyond the power of the most tyrannical Government to arrest us. Then there will hardly be any talk about arrests. Laws will get broken fast. One today, another tomorrow. And, when laws are destroyed, how can the Empire continue to function? Headmen and Talatis should resign. They should know that it is God alone who provides us our daily bread. What difference does it make whether or not you get Rs. 37 as a Talati? Mill workers—of whom I happen to be one—earn fifty rupees. However, although they can threaten mill-owners to go on strike, the latter do not dismiss them. They cannot do without the workers. If a Talati seeks employment in a mill and works faithfully, he can earn Rs. 50 or more if he shows good work. It will be the easiest thing for him to earn Rs. 37. Even if he happened to be a cripple, he could earn a living through spinning. Earning a livelihood is no problem to one who is prepared to work. What will the Government do when Talatis and Government servants are no longer afraid? Will it send for troops from England and entrust to them the work of Talatis and Headmen? What action will it take when Hindus, Muslims and Parsis all refuse to co-operate with it? It will be able to do nothing. All its limbs will become immobilized. In this manner, swaraj will be in our pocket without any effort, without a single person having to go to jail. But whom shall I teach all this? You find khadi coarse and expensive. You wish to appear naked while I wish to clothe you. It seems to have become a dharma today to appear naked in spite of the clothing that is worn. It is a rakshasi dharma, it is only under this Empire that going naked becomes a dharma. We wear clothes to cover our bodies. If you wish to go about naked, why clothe yourselves? Under this Empire, going naked is no crime at all. You may therefore remain so. If you do wish to clothe yourselves to cover your bodies, what better material than khadi can I offer you? Why do you wish for anything else? You are ashamed to wear clothes woven out of yarn spun by your mothers and sisters who are starving at home. Today you must understand the dharma of the boycott of foreign cloth, because it is impossible to give up British cloth while still using Japanese material. If we attempt to do so, we shall not be able to achieve either of our objectives—we shall not be able to do away with British goods and Japan will start ruling over us instead of Britain. Then again, you may claim that cloth from both countries could be boycotted by using mill-made cloth. Mills have existed now for fifty years. Nevertheless there has been no boycott. Why? I have been shouting repeatedly that boycott is impossible without khadi. You could practise boycott with the help of khadi and the textile mills. But it is impossible today to carry on boycott depending on mills alone. Maybe it can be done in fifty or a hundred years. If you intend to do so through fighting and bloodshed that is a matter about which I know nothing, it is beyond my conception, it is something which I have renounced. If the women of Surat come to Mithubehn’s assistance, prohibition can be accomplished in Surat district in no time. And what is so attractive about that trade? Those who run liquor dens can earn a living from some other occupation. Whatever may happen in India, I am resolved that either I shall die offering civil disobedience or I shall win swaraj. I, therefore, called these people together and set out on this march. If I am alive tomorrow, I shall start out from here after receiving your blessings. I invite those who care to accompany me. It is a blessing that Hindus and Muslims here are, for the present, united and are not quarrelling. I was afraid that since I am tired of the fighting, I might not like to go to a place where these two communities were fighting and if I did go there, that I would die. So I wrote to the workers not to take me to the city in order to kill me, but to let me reach Dandi. I was informed, however, that for the present they were as good as united and that there were no quarrels between them. I do not believe, however, that Hindus and Muslims have become one yet. Why should there be any ill feeling, any distrust, or any fear of one another even for a fraction of a second between them? Can there be a worse government than the present one? There would be about a lakh officers in this country. What will you do with the remaining 299.9 million people? How will you account for them? To what purpose will you fight against one another? Give me a seat in the legislative assembly only if there is any left after giving them to Muslims, Parsis, Christians and all others. You may consider the salt tax as abolished if you are true to your salt. Even poor, needy Muslims are its victims. We can fight amongst ourselves after it is repealed. The religious books of both Hinduism and Islam regard liquor as something sinful. The Zoroastrians do not read their religious texts carefully. They should read what they say about liquor. Please give me your blessings and pray to God that He may grant my wishes. Postpone the settlement of your disputes till after the salt tax is repealed. What strength you will gain if you do so! If this tax is repealed we shall save six crores of rupees. Then adding 25 crores to be saved by prohibition and 60 crores from boycott of foreign cloth—it makes a total of Rs. 91 crores. Take it as a present. If you refuse it, you will be answerable not to me but to God. May God grant you the wisdom to understand all this and to act accordingly.",
        "date": "April 1, 1930",
        "source": "[From Gujarati] Prajabandhu, 6-4-1930"
    },
    {
        "speech": "speech at dindoli",
        "text": "We were told that it was doubtful whether Congress workers would be allowed to halt here at all. I must say, however, that so far we have received nothing but warm welcome everywhere. Both the factions in this village have united in looking after us well and have been equally warm in welcoming us. There is the hand of God in this struggle. That is why one finds today that people have ceased to be enemies and become friends of each other. It is all the grace of God. In the Privy Council, disputes are not settled for generations together. You must free yourselves from that snare. We are carrying on this struggle against those who are riding on the backs of others. We have to free our millions of the burden which the white man has placed on them. But first we ourselves have to get off the backs of the poor. If anyone says that the Government will cease to function if the salt tax is repealed, I will say that such a person is not true to his salt. From the fact that a larger quantity of salt is sold when the tax rate is lowered, we can conclude that it is the poor who suffer the most from this tax. In the past the poor used to get even clothes. And in the past the workers in villages got everything in kind in exchange for their labour. However much the Government may try, can it ever make these foreign rags cheaper than khadi? I congratulate the Headman for the other bit of news given me. I also congratulate the village which has such a courageous Headman. Those who have not yet resigned should do so and cease to be afraid of the Government. I am surprised a person like me who cannot wield even a tiny stick can make such a mighty Empire tremble. However, if Rama dwells in your hearts, it is easy to shake the foundations of not one but twenty empires more powerful than this one. Like the old",
        "date": "April 2, 1930",
        "source": "[From Gujarati] Prajabandhu, 6-4-1930"
    }
]